Catalogs/УНСФ_ПозицииСмет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УНСФ_ПозицииСмет</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.УНСФ_Смета</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОД_СтарыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОД_СтарыйКодРодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазделСметы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УНСФ_СметныеРасценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УНСФ_ТипОбъемаРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаМатериалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаРесурсов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПозицииФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>22</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УНСФ_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ОД_КопированиеПозицийРазделовСметы/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пар_ИсходнаяСмета = Параметры.ИсходнаяСмета;
	Пар_ПозицияРаздел = Параметры.ПозицияРаздел;
	
КонецПроцедуры

#Область НажатиеКнопки

&НаКлиенте
Процедура Копировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Смета) Тогда
		Сообщить("Сперва выберите смету!");	
	Иначе
		КопироватьНаСервере();		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура КопироватьНаСервере()
	
	Если Пар_ПозицияРаздел.РазделСметы Тогда
		//КопироватьРазделСметы();
		КопироватьРазделСметыВариант(Пар_ПозицияРаздел, Справочники.УНСФ_ПозицииСмет.ПустаяСсылка());
		Сообщить("Копирование раздела завершено");
	Иначе
		КопироватьПозициюСметы();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КопироватьПозициюСметы()
	
	НПС = Справочники.УНСФ_ПозицииСмет.СоздатьЭлемент();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНСФ_ПозицииСмет.Ссылка КАК Ссылка,
		|	УНСФ_ПозицииСмет.Владелец КАК Владелец,
		|	УНСФ_ПозицииСмет.Родитель КАК Родитель,
		|	УНСФ_ПозицииСмет.Код КАК Код,
		|	УНСФ_ПозицииСмет.Наименование КАК Наименование,
		|	УНСФ_ПозицииСмет.Расценка КАК Расценка,
		|	УНСФ_ПозицииСмет.СуммаПозиции КАК СуммаПозиции,
		|	УНСФ_ПозицииСмет.Объем КАК Объем,
		|	УНСФ_ПозицииСмет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	УНСФ_ПозицииСмет.СуммаМатериалов КАК СуммаМатериалов,
		|	УНСФ_ПозицииСмет.СуммаРесурсов КАК СуммаРесурсов,
		|	УНСФ_ПозицииСмет.СуммаЗарплаты КАК СуммаЗарплаты,
		|	УНСФ_ПозицииСмет.Комментарий КАК Комментарий,
		|	УНСФ_ПозицииСмет.НаименованиеПолное КАК НаименованиеПолное,
		|	УНСФ_ПозицииСмет.СуммаПозицииФайла КАК СуммаПозицииФайла,
		|	УНСФ_ПозицииСмет.ВидРабот КАК ВидРабот
		|ИЗ
		|	Справочник.УНСФ_ПозицииСмет КАК УНСФ_ПозицииСмет
		|ГДЕ
		|	УНСФ_ПозицииСмет.РазделСметы = ЛОЖЬ
		|	И УНСФ_ПозицииСмет.Ссылка = &СсылкаНаПозициюСметы";
	
	Запрос.УстановитьПараметр("СсылкаНаПозициюСметы", Пар_ПозицияРаздел);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВДЗ = РезультатЗапроса.Выбрать();	
	Если ВДЗ.Следующий() Тогда
		
		НПС.Владелец = Смета;
		НПС.Наименование = ВДЗ.Наименование; НПС.Расценка = ВДЗ.Расценка;
		НПС.СуммаПозиции = ВДЗ.СуммаПозиции; НПС.Объем = ВДЗ.Объем; 
		НПС.ЕдиницаИзмерения = ВДЗ.ЕдиницаИзмерения; НПС.СуммаМатериалов = ВДЗ.СуммаМатериалов;
		НПС.СуммаРесурсов = ВДЗ.СуммаРесурсов; НПС.СуммаЗарплаты = ВДЗ.СуммаЗарплаты;
		НПС.Комментарий = "Создана копированием из " + Пар_ИсходнаяСмета;
		НПС.НаименованиеПолное = ВДЗ.НаименованиеПолное;
		НПС.ВидРабот = ВДЗ.ВидРабот;
		
	КонецЕсли; 
	
	Для Каждого Значение из Пар_ПозицияРаздел.Ресурсы Цикл
		
		НС = НПС.Ресурсы.Добавить();
		
		НС.Ресурс = Значение.Ресурс; НС.Количество = Значение.Количество;
		НС.КоличествоВсего = Значение.КоличествоВсего; НС.Цена = Значение.Цена;
		НС.Сумма = Значение.Сумма; 
		
	КонецЦикла; 
	
	Для Каждого Значение из Пар_ПозицияРаздел.Материалы Цикл
		
		НС = НПС.Материалы.Добавить();
		
		НС.Номенклатура = Значение.Номенклатура; НС.Характеристика = Значение.Характеристика;
		НС.ЕдиницаИзмерения = Значение.ЕдиницаИзмерения; НС.Количество = Значение.Количество;
		НС.КоличествоВсего = Значение.КоличествоВсего; НС.Цена = Значение.Цена;
		НС.Сумма = Значение.Сумма;
		
	КонецЦикла;  
	
	Для Каждого Значение из Пар_ПозицияРаздел.Конструктивы Цикл
		
		НС = НПС.Конструктивы.Добавить();
		
		НС.Конструктив = Значение.Конструктив;
		
	КонецЦикла; 
	
	Попытка 
		НПС.Записать();
		Сообщить("Копирование позиции завершено");
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;  
		
КонецПроцедуры 

&НаСервере
Процедура КопироватьРазделСметы()

	МасРазделовСсылка = Новый Массив;
	МасРазделовНаименованиеРодителя = Новый Массив;
	МасРазделовНаименование = Новый Массив;
	ВыбранныйРазделСметы = Пар_ПозицияРаздел;
	
	МасРазделовСсылка.Добавить(ВыбранныйРазделСметы);
	МасРазделовНаименованиеРодителя.Добавить("" + ВыбранныйРазделСметы.Родитель);
	МасРазделовНаименование.Добавить("" + ВыбранныйРазделСметы.Наименование);
	
	ЗаполнитьМассивРазделовРекурс(МасРазделовСсылка, МасРазделовНаименованиеРодителя, МасРазделовНаименование);
	
	Индекс = МасРазделовСсылка.Количество() - 1;
	
	Для ш = 0 по МасРазделовСсылка.Количество() - 1 Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УНСФ_ПозицииСмет.Ссылка КАК Ссылка,
			|	УНСФ_ПозицииСмет.Владелец КАК Владелец,
			|	УНСФ_ПозицииСмет.Родитель КАК Родитель,
			|	УНСФ_ПозицииСмет.Код КАК Код,
			|	УНСФ_ПозицииСмет.Наименование КАК Наименование,
			|	УНСФ_ПозицииСмет.Расценка КАК Расценка,
			|	УНСФ_ПозицииСмет.СуммаПозиции КАК СуммаПозиции,
			|	УНСФ_ПозицииСмет.Объем КАК Объем,
			|	УНСФ_ПозицииСмет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	УНСФ_ПозицииСмет.СуммаМатериалов КАК СуммаМатериалов,
			|	УНСФ_ПозицииСмет.СуммаРесурсов КАК СуммаРесурсов,
			|	УНСФ_ПозицииСмет.СуммаЗарплаты КАК СуммаЗарплаты,
			|	УНСФ_ПозицииСмет.Комментарий КАК Комментарий,
			|	УНСФ_ПозицииСмет.НаименованиеПолное КАК НаименованиеПолное,
			|	УНСФ_ПозицииСмет.СуммаПозицииФайла КАК СуммаПозицииФайла,
			|	УНСФ_ПозицииСмет.ВидРабот КАК ВидРабот
			|ИЗ
			|	Справочник.УНСФ_ПозицииСмет КАК УНСФ_ПозицииСмет
			|ГДЕ
			|	УНСФ_ПозицииСмет.РазделСметы = ИСТИНА
			|	И УНСФ_ПозицииСмет.Ссылка = &СсылкаНаРазделСметы";
		
		Запрос.УстановитьПараметр("СсылкаНаРазделСметы", МасРазделовСсылка[ш]);
		РезультатЗапроса = Запрос.Выполнить();	
		ВДЗ = РезультатЗапроса.Выбрать();	
		Если ВДЗ.Следующий() Тогда
			
			НРС = Справочники.УНСФ_ПозицииСмет.СоздатьЭлемент();
			
			НРС.Владелец = Смета; 
			Если ш = 0 Тогда
				НРС.Родитель = Справочники.УНСФ_ПозицииСмет.ПустаяСсылка();	
			Иначе
				НРС.Родитель = ПолучитьНовогоРодителяРаздела(МасРазделовНаименованиеРодителя[ш], МасРазделовНаименование[ш]);	
			КонецЕсли;
			НРС.Наименование = ВДЗ.Наименование; НРС.Расценка = ВДЗ.Расценка;
			НРС.СуммаПозиции = ВДЗ.СуммаПозиции; НРС.Объем = ВДЗ.Объем; 
			НРС.ЕдиницаИзмерения = ВДЗ.ЕдиницаИзмерения; НРС.СуммаМатериалов = ВДЗ.СуммаМатериалов;
			НРС.СуммаРесурсов = ВДЗ.СуммаРесурсов; НРС.СуммаЗарплаты = ВДЗ.СуммаЗарплаты;
			НРС.Комментарий = "Создан копированием из " + Пар_ИсходнаяСмета + " в " + ТекущаяДата();
			НРС.НаименованиеПолное = ВДЗ.НаименованиеПолное;
			НРС.ВидРабот = ВДЗ.ВидРабот; НРС.РазделСметы = ИСТИНА;
			
			Попытка 
				НРС.Записать();
				Сообщить("Копирование раздела завершено");
			Исключение
				Сообщить(ОписаниеОшибки());	
			КонецПопытки;
			
		КонецЕсли;	 
		
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНСФ_ПозицииСмет.Ссылка КАК Ссылка,
		|	УНСФ_ПозицииСмет.Владелец КАК Владелец,
		|	УНСФ_ПозицииСмет.Родитель КАК Родитель,
		|	УНСФ_ПозицииСмет.Код КАК Код,
		|	УНСФ_ПозицииСмет.Наименование КАК Наименование,
		|	УНСФ_ПозицииСмет.Расценка КАК Расценка,
		|	УНСФ_ПозицииСмет.СуммаПозиции КАК СуммаПозиции,
		|	УНСФ_ПозицииСмет.Объем КАК Объем,
		|	УНСФ_ПозицииСмет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	УНСФ_ПозицииСмет.СуммаМатериалов КАК СуммаМатериалов,
		|	УНСФ_ПозицииСмет.СуммаРесурсов КАК СуммаРесурсов,
		|	УНСФ_ПозицииСмет.СуммаЗарплаты КАК СуммаЗарплаты,
		|	УНСФ_ПозицииСмет.Комментарий КАК Комментарий,
		|	УНСФ_ПозицииСмет.НаименованиеПолное КАК НаименованиеПолное,
		|	УНСФ_ПозицииСмет.СуммаПозицииФайла КАК СуммаПозицииФайла,
		|	УНСФ_ПозицииСмет.ВидРабот КАК ВидРабот
		|ИЗ
		|	Справочник.УНСФ_ПозицииСмет КАК УНСФ_ПозицииСмет
		|ГДЕ
		|	УНСФ_ПозицииСмет.РазделСметы = ЛОЖЬ
		|	И УНСФ_ПозицииСмет.Родитель.Ссылка В (&СсылкаНаПозициюСметы)";
	
	Запрос.УстановитьПараметр("СсылкаНаПозициюСметы", МасРазделовСсылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВДЗ = РезультатЗапроса.Выбрать();	
	Пока ВДЗ.Следующий() Цикл
		
		НПС = Справочники.УНСФ_ПозицииСмет.СоздатьЭлемент();
		
		НПС.Владелец = Смета; НПС.Родитель = ПолучитьНовогоРодителяПозиции(ВДЗ.Ссылка);
		НПС.Наименование = ВДЗ.Наименование; НПС.Расценка = ВДЗ.Расценка;
		НПС.СуммаПозиции = ВДЗ.СуммаПозиции; НПС.Объем = ВДЗ.Объем; 
		НПС.ЕдиницаИзмерения = ВДЗ.ЕдиницаИзмерения; НПС.СуммаМатериалов = ВДЗ.СуммаМатериалов;
		НПС.СуммаРесурсов = ВДЗ.СуммаРесурсов; НПС.СуммаЗарплаты = ВДЗ.СуммаЗарплаты;
		НПС.Комментарий = "Создана копированием из " + Пар_ИсходнаяСмета;
		НПС.НаименованиеПолное = ВДЗ.НаименованиеПолное;
		НПС.ВидРабот = ВДЗ.ВидРабот;
		
		Для Каждого ЗначениеР из ВДЗ.Ссылка.Ресурсы Цикл
		
			НС = НПС.Ресурсы.Добавить();
			
			НС.Ресурс = ЗначениеР.Ресурс; НС.Количество = ЗначениеР.Количество;
			НС.КоличествоВсего = ЗначениеР.КоличествоВсего; НС.Цена = ЗначениеР.Цена;
			НС.Сумма = ЗначениеР.Сумма; 
			
		КонецЦикла; 
		
		Для Каждого ЗначениеМ из ВДЗ.Ссылка.Материалы Цикл
			
			НС = НПС.Материалы.Добавить();
			
			НС.Номенклатура = ЗначениеМ.Номенклатура; НС.Характеристика = ЗначениеМ.Характеристика;
			НС.ЕдиницаИзмерения = ЗначениеМ.ЕдиницаИзмерения; НС.Количество = ЗначениеМ.Количество;
			НС.КоличествоВсего = ЗначениеМ.КоличествоВсего; НС.Цена = ЗначениеМ.Цена;
			НС.Сумма = ЗначениеМ.Сумма;
			
		КонецЦикла;  
		
		Для Каждого ЗначениеК из ВДЗ.Ссылка.Конструктивы Цикл
			
			НС = НПС.Конструктивы.Добавить();
			
			НС.Конструктив = ЗначениеК.Конструктив;
			
		КонецЦикла; 
		
		Попытка 
			НПС.Записать();
			Сообщить("Копирование позиции завершено");
		Исключение
			Сообщить(ОписаниеОшибки());	
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
Процедура КопироватьРазделСметыВариант(СсылкаНаРаздел, СсылкаНаРодителяРаздел)
	
	НРС = Справочники.УНСФ_ПозицииСмет.СоздатьЭлемент();
	НРС.Наименование = СсылкаНаРаздел.Наименование; 
	НРС.РазделСметы = Истина; НРС.Родитель = СсылкаНаРодителяРаздел;
	НРС.Владелец = Смета; НРС.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНСФ_ПозицииСмет.Ссылка КАК Ссылка,
		|	УНСФ_ПозицииСмет.ВерсияДанных КАК ВерсияДанных,
		|	УНСФ_ПозицииСмет.ПометкаУдаления КАК ПометкаУдаления,
		|	УНСФ_ПозицииСмет.Владелец КАК Владелец,
		|	УНСФ_ПозицииСмет.Родитель КАК Родитель,
		|	УНСФ_ПозицииСмет.Код КАК Код,
		|	УНСФ_ПозицииСмет.Наименование КАК Наименование,
		|	УНСФ_ПозицииСмет.РазделСметы КАК РазделСметы,
		|	УНСФ_ПозицииСмет.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
		|	УНСФ_ПозицииСмет.Расценка КАК Расценка,
		|	УНСФ_ПозицииСмет.СуммаПозиции КАК СуммаПозиции,
		|	УНСФ_ПозицииСмет.Объем КАК Объем,
		|	УНСФ_ПозицииСмет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	УНСФ_ПозицииСмет.СуммаМатериалов КАК СуммаМатериалов,
		|	УНСФ_ПозицииСмет.СуммаРесурсов КАК СуммаРесурсов,
		|	УНСФ_ПозицииСмет.СуммаЗарплаты КАК СуммаЗарплаты,
		|	УНСФ_ПозицииСмет.Комментарий КАК Комментарий,
		|	УНСФ_ПозицииСмет.НаименованиеПолное КАК НаименованиеПолное,
		|	УНСФ_ПозицииСмет.СуммаПозицииФайла КАК СуммаПозицииФайла,
		|	УНСФ_ПозицииСмет.ВидРабот КАК ВидРабот
		|ИЗ
		|	Справочник.УНСФ_ПозицииСмет КАК УНСФ_ПозицииСмет
		|ГДЕ
		|	УНСФ_ПозицииСмет.Владелец = &ЭтаСмета
		|	И УНСФ_ПозицииСмет.Родитель = &СсылкаНаРод
		|	И УНСФ_ПозицииСмет.ПометкаУдаления = &Ложь
		|	И УНСФ_ПозицииСмет.РазделСметы = &Ложь";
	
	Запрос.УстановитьПараметр("ЭтаСмета", Пар_ИсходнаяСмета);
	Запрос.УстановитьПараметр("СсылкаНаРод", СсылкаНаРаздел);
	Запрос.УстановитьПараметр("Ложь", Ложь);
	РезультатЗапроса = Запрос.Выполнить();	
	ВДЗ = РезультатЗапроса.Выбрать();	
	Пока ВДЗ.Следующий() Цикл
		
		НПС = Справочники.УНСФ_ПозицииСмет.СоздатьЭлемент();
		НПС.Владелец = Смета; НПС.Родитель = НРС.Ссылка;
		НПС.Наименование = ВДЗ.Наименование; НПС.Расценка = ВДЗ.Расценка;
		НПС.СуммаПозиции = ВДЗ.СуммаПозиции; НПС.Объем = ВДЗ.Объем; 
		НПС.ЕдиницаИзмерения = ВДЗ.ЕдиницаИзмерения; НПС.СуммаМатериалов = ВДЗ.СуммаМатериалов;
		НПС.СуммаРесурсов = ВДЗ.СуммаРесурсов; НПС.СуммаЗарплаты = ВДЗ.СуммаЗарплаты;
		НПС.Комментарий = "Создана копированием из " + Пар_ИсходнаяСмета;
		НПС.НаименованиеПолное = ВДЗ.НаименованиеПолное;
		НПС.ВидРабот = ВДЗ.ВидРабот;
		
		Для Каждого Значение из ВДЗ.Ссылка.Ресурсы Цикл
			НР = НПС.Ресурсы.Добавить();
			НР.Ресурс = Значение.Ресурс; НР.Количество = Значение.Количество;
			НР.КоличествоВсего = Значение.КоличествоВсего;
			НР.Цена = Значение.Цена; НР.Сумма = Значение.Сумма;
		КонецЦикла;
		
		Для Каждого Значение из ВДЗ.Ссылка.Материалы Цикл
			НМ = НПС.Материалы.Добавить();
			НМ.Номенклатура = Значение.Номенклатура; НМ.Характеристика = Значение.Характеристика;
			НМ.ЕдиницаИзмерения = Значение.ЕдиницаИзмерения; НМ.Цена = Значение.Цена;
			НМ.Количество = Значение.Количество; НМ.Сумма = Значение.Сумма;
			НМ.КоличествоВсего = Значение.КоличествоВсего;
		КонецЦикла;
		
		Для Каждого Значение из ВДЗ.Ссылка.Конструктивы Цикл
			НК = НПС.Конструктивы.Добавить();
			НК.Конструктив = Значение.Конструктив;
		КонецЦикла; 
		
		НПС.Записать();	
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНСФ_ПозицииСмет.Ссылка КАК Ссылка,
		|	УНСФ_ПозицииСмет.ВерсияДанных КАК ВерсияДанных,
		|	УНСФ_ПозицииСмет.ПометкаУдаления КАК ПометкаУдаления,
		|	УНСФ_ПозицииСмет.Владелец КАК Владелец,
		|	УНСФ_ПозицииСмет.Родитель КАК Родитель,
		|	УНСФ_ПозицииСмет.Код КАК Код,
		|	УНСФ_ПозицииСмет.Наименование КАК Наименование,
		|	УНСФ_ПозицииСмет.РазделСметы КАК РазделСметы,
		|	УНСФ_ПозицииСмет.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
		|	УНСФ_ПозицииСмет.Расценка КАК Расценка,
		|	УНСФ_ПозицииСмет.СуммаПозиции КАК СуммаПозиции,
		|	УНСФ_ПозицииСмет.Объем КАК Объем,
		|	УНСФ_ПозицииСмет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	УНСФ_ПозицииСмет.СуммаМатериалов КАК СуммаМатериалов,
		|	УНСФ_ПозицииСмет.СуммаРесурсов КАК СуммаРесурсов,
		|	УНСФ_ПозицииСмет.СуммаЗарплаты КАК СуммаЗарплаты,
		|	УНСФ_ПозицииСмет.Комментарий КАК Комментарий,
		|	УНСФ_ПозицииСмет.НаименованиеПолное КАК НаименованиеПолное,
		|	УНСФ_ПозицииСмет.СуммаПозицииФайла КАК СуммаПозицииФайла,
		|	УНСФ_ПозицииСмет.ВидРабот КАК ВидРабот
		|ИЗ
		|	Справочник.УНСФ_ПозицииСмет КАК УНСФ_ПозицииСмет
		|ГДЕ
		|	УНСФ_ПозицииСмет.Владелец = &ЭтаСмета
		|	И УНСФ_ПозицииСмет.Родитель = &СсылкаНаРод
		|	И УНСФ_ПозицииСмет.ПометкаУдаления = &Ложь
		|	И УНСФ_ПозицииСмет.РазделСметы = &Истина";
	
	Запрос.УстановитьПараметр("ЭтаСмета", Пар_ИсходнаяСмета);
	Запрос.УстановитьПараметр("СсылкаНаРод", СсылкаНаРаздел);
	Запрос.УстановитьПараметр("Ложь", Ложь);
	Запрос.УстановитьПараметр("Истина", Истина);
	РезультатЗапроса = Запрос.Выполнить();	
	ВДЗ = РезультатЗапроса.Выбрать();	
	Пока ВДЗ.Следующий() Цикл
		КопироватьРазделСметыВариант(ВДЗ.Ссылка, НРС.Ссылка);		
	КонецЦикла;
	
	Об = Смета.ПолучитьОбъект();
	Об.Стоимость = Справочники.УНСФ_Смета.ПолучитьСуммуСметы(Смета);
	Об.Записать();
	
КонецПроцедуры

#КонецОбласти  

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьМассивРазделовРекурс(МассивЗаполнения, МассивНаименованийРодителей, МассивНаименований)
	
	ДлинаМассиваДоПоиска = МассивЗаполнения.Количество();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНСФ_ПозицииСмет.Ссылка КАК Ссылка,
		|	УНСФ_ПозицииСмет.Родитель КАК Родитель,
		|	УНСФ_ПозицииСмет.Наименование КАК Наименование
		|ИЗ
		|	Справочник.УНСФ_ПозицииСмет КАК УНСФ_ПозицииСмет
		|ГДЕ
		|	УНСФ_ПозицииСмет.РазделСметы = ИСТИНА
		|	И УНСФ_ПозицииСмет.ПометкаУдаления = Ложь
		|	И УНСФ_ПозицииСмет.Владелец = &Владелец
		|	И УНСФ_ПозицииСмет.Родитель В (&МассивРодителей)";
	
	Запрос.УстановитьПараметр("Владелец", Пар_ИсходнаяСмета);
	Запрос.УстановитьПараметр("МассивРодителей", МассивЗаполнения);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДелатльныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДелатльныеЗаписи.Следующий() Цикл
		
		Если МассивЗаполнения.Найти(ВыборкаДелатльныеЗаписи.Ссылка) = Неопределено Тогда
			МассивЗаполнения.Добавить(ВыборкаДелатльныеЗаписи.Ссылка);
			МассивНаименованийРодителей.Добавить("" + ВыборкаДелатльныеЗаписи.Родитель);
			МассивНаименований.Добавить("" + ВыборкаДелатльныеЗаписи.Наименование);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДлинаМассиваДоПоиска <> МассивЗаполнения.Количество() Тогда
		ЗаполнитьМассивРазделовРекурс(МассивЗаполнения, МассивНаименованийРодителей, МассивНаименований);		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьНовогоРодителяРаздела(НаименованиеРодителя, Наименование)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНСФ_ПозицииСмет.Ссылка КАК Ссылка
		|ИЗ
		|Справочник.УНСФ_ПозицииСмет КАК УНСФ_ПозицииСмет
		|ГДЕ
		|	УНСФ_ПозицииСмет.РазделСметы = ИСТИНА
		|	И УНСФ_ПозицииСмет.Владелец = &ТекСмета
		|	И ВЫРАЗИТЬ(УНСФ_ПозицииСмет.Ссылка.Комментарий КАК СТРОКА(150)) = &Комментарий
		|	И УНСФ_ПозицииСмет.Ссылка.Наименование = &НаименованиеРодителя";
	
	Запрос.УстановитьПараметр("НаименованиеРодителя", НаименованиеРодителя);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("ТекСмета", Смета);
	Запрос.УстановитьПараметр("Комментарий", "Создан копированием из " + Пар_ИсходнаяСмета + " в " + ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДелатльныеЗаписи = РезультатЗапроса.Выбрать();	
	
	Если ВыборкаДелатльныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДелатльныеЗаписи.Ссылка;	
	Иначе
		Возврат Справочники.УНСФ_ПозицииСмет.ПустаяСсылка();	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция РодительПозицииВМассиве(Позиция, МассивРазделов)

	Для Каждого Значение из МассивРазделов Цикл
		Если Позиция.Родитель = Значение Тогда
			Возврат Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьНовогоРодителяПозиции(Позиция)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНСФ_ПозицииСмет.Ссылка КАК Ссылка
		|ИЗ
		|Справочник.УНСФ_ПозицииСмет КАК УНСФ_ПозицииСмет
		|ГДЕ
		|	УНСФ_ПозицииСмет.РазделСметы = ИСТИНА
		|	И УНСФ_ПозицииСмет.Владелец = &ТекСмета
		|	И ВЫРАЗИТЬ(УНСФ_ПозицииСмет.Ссылка.Комментарий КАК СТРОКА(150)) = &Комментарий
		|	И УНСФ_ПозицииСмет.Ссылка.Наименование = &НаименованиеРодителя";
	
	Запрос.УстановитьПараметр("НаименованиеРодителя", Позиция.Родитель.Наименование);
	Запрос.УстановитьПараметр("ТекСмета", Смета);
	Запрос.УстановитьПараметр("Комментарий", "Создан копированием из " + Пар_ИсходнаяСмета + " в " + ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДелатльныеЗаписи = РезультатЗапроса.Выбрать();	
	
	Если ВыборкаДелатльныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДелатльныеЗаписи.Ссылка;	
	Иначе
		Возврат Справочники.УНСФ_ПозицииСмет.ПустаяСсылка();	
	КонецЕсли;	
КонецФункции

#КонецОбласти
